# Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

### 1. describe() -  describes statistics of all the columns

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 2. unique() - shouws unique values

In [5]:
df['Survived'].unique()

array([0, 1])

### 3. head(n) - by default lists first 5 rows if n is not provided

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 4. tail(n) - if n is not provided then by default lists last 5 rows

In [8]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 5.value_counts() - counts the number of values for each category

In [11]:
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [61]:
df1 = pd.DataFrame(
    {
        'A':['Alice','Bob','Claire','Dan','Effany','Ron','Kara'],
        'B':[25,30,27,30,21,19,24],
        'C':['Female','Male','Female','Male','Female','Male','Female']
    }
)

print(df1)

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
3     Dan  30    Male
4  Effany  21  Female
5     Ron  19    Male
6    Kara  24  Female

In [62]:
df1['index']=[i for i in range(1,len(df1)*2,2)]
df1

        A   B       C  index
0   Alice  25  Female      1
1     Bob  30    Male      3
2  Claire  27  Female      5
3     Dan  30    Male      7
4  Effany  21  Female      9
5     Ron  19    Male     11
6    Kara  24  Female     13

In [63]:
df1 = df1.set_index('index')
df1

            A   B       C
index
1       Alice  25  Female
3         Bob  30    Male
5      Claire  27  Female
7         Dan  30    Male
9      Effany  21  Female
11        Ron  19    Male
13       Kara  24  Female

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [64]:
df2=pd.DataFrame({
    'Values':[10,20,30,40,50,60,70]
})
df2

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70

In [65]:
#df['Values'].iloc[0:3].sum()
def get_sum():
    sum=0
    for i in range(0,3):
        sum+=df2['Values'].iloc[i]
    return sum
get_sum()

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [69]:
df3 = pd.DataFrame({
    'Text':['Ball','Bat','Helmet','Guard']
})
df3

     Text
0    Ball
1     Bat
2  Helmet
3   Guard

In [70]:
def word_count(text):
    return len(text)

df3['Word_Count']=df3['Text'].apply(lambda x: word_count(x))

df3

     Text  Word_Count
0    Ball           4
1     Bat           3
2  Helmet           6
3   Guard           5

# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [76]:
df1.size

21

In [75]:
df1.shape

(7, 3)

shape property provides the shape in the form of tuple containing numbers of rows and columns
(rows,columns)

size property provides single value by multiplying number of rows and number of columns
rows * columns

# Q6. Which function of pandas do we use to read an excel file?

read_excel(path)

# Q7.
You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.


The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [77]:
df4 = pd.DataFrame({
    'Email':['ron@gmail.com','ronak.singh@gmail.com','bedi.reena@yahoo.com']
})
df4

                   Email
0          ron@gmail.com
1  ronak.singh@gmail.com
2   bedi.reena@yahoo.com

In [78]:
def get_username(email):
    return email.split('@')[0]

df4['Username']=df4['Email'].apply(lambda x:get_username(x))

df4

                   Email     Username
0          ron@gmail.com          ron
1  ronak.singh@gmail.com  ronak.singh
2   bedi.reena@yahoo.com   bedi.reena

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'.


Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
    
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: 
  A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [80]:
df5=pd.DataFrame({
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
})
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [81]:

def return_df(temp):
    return temp[(temp['A']>5) & (temp['B']<10)]
return_df(df5)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [82]:
df2=pd.DataFrame({
    'Values':[10,20,30,40,50,60,70]
})
df2

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70

In [89]:
import numpy as np

def return_stats(temp):
    return np.mean(temp),np.median(temp),np.std(temp)

mean,median,mode=return_stats(df2)
print('mean  : ',mean.values[0])
print('median : ',median)
print('mode : ',mode.values[0])

mean  :  40.0
median :  40.0
mode :  20.0

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [26]:
from datetime import datetime
import pandas as pd

# start date
start_date = datetime.strptime("2023-02-21", "%Y-%m-%d")
end_date = datetime.strptime("2023-03-05", "%Y-%m-%d")

# difference between each date. D means one day
D = 'D'

date_list = pd.date_range(start_date, end_date, freq=D)
# if you want dates in string format then convert it into string
print(date_list.strftime("%Y-%m-%d"))

Index(['2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24', '2023-02-25',
       '2023-02-26', '2023-02-27', '2023-02-28', '2023-03-01', '2023-03-02',
       '2023-03-03', '2023-03-04', '2023-03-05'],
      dtype='object')

In [37]:
import numpy as np

df3 = pd.DataFrame(columns=['Date','Sales'])

df3['Date']=date_list
sales=[int(np.random.rand(1)*100) for i in range(0,len(df3))]
df3['Sales']=sales

print(df3)

         Date  Sales
0  2023-02-21     24
1  2023-02-22     43
2  2023-02-23     64
3  2023-02-24     52
4  2023-02-25     34
5  2023-02-26     96
6  2023-02-27     62
7  2023-02-28     60
8  2023-03-01     77
9  2023-03-02     37
10 2023-03-03     22
11 2023-03-04     55
12 2023-03-05     12

In [38]:
df3['MovingAverage'] = df3.iloc[:,1].rolling(window=7).mean()

In [39]:
print(df3)

         Date  Sales  MovingAverage
0  2023-02-21     24            NaN
1  2023-02-22     43            NaN
2  2023-02-23     64            NaN
3  2023-02-24     52            NaN
4  2023-02-25     34            NaN
5  2023-02-26     96            NaN
6  2023-02-27     62      53.571429
7  2023-02-28     60      58.714286
8  2023-03-01     77      63.571429
9  2023-03-02     37      59.714286
10 2023-03-03     22      55.428571
11 2023-03-04     55      58.428571
12 2023-03-05     12      46.428571

# Q11. 
You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.


For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:
    Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday

The function should return the modified DataFrame.

In [50]:
import pandas as pd


df4 = pd.DataFrame({'Date':['2023-03-05','2015-01-02','2020-01-03']})
df4['Date'] = pd.to_datetime(df4['Date'])
print(df4)

        Date
0 2023-03-05
1 2015-01-02
2 2020-01-03

In [51]:
def get_day_of_week(temp):
    temp['Weekday']=temp['Date'].dt.day_name()
    return temp

print(get_day_of_week(df4.copy()))

        Date Weekday
0 2023-03-05  Sunday
1 2015-01-02  Friday
2 2020-01-03  Friday

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

We need to import pandas library ->

import pandas